In [273]:
import pandas as pd

In [274]:
df_data = pd.read_excel('data_mahasiswa.xlsx')
df_data.head()

   nama        nim  nilai_uts  nilai_uas  nilai_tugas  nilai_akhir grade
0  Budi  123140001         80         90           85         85.5     A
1  Siti  123140002         70         75           80         75.0     B
2  Andi  123140003         65         60           70         64.5     C
3  Rina  123140004         85         80           90         84.5     A
4  Doni  123140005         50         55           60         55.0     D

### Fungsi nilai akhir

In [275]:
def nilai_akhir(uts, uas, tugas):
    return (0.3 * uts) + (0.4 * uas) + (0.3 * tugas)

### Fungsi tentukan grade

In [276]:
def tentukan_grade(nilai):
    if nilai >= 80 :
        return "A"
    elif nilai >= 70 :
        return "B"
    elif nilai >= 60 :
        return "C"
    elif nilai >= 50 :
        return "D"
    else :
        return "E"

### Tambahkan kolom baru ke DataFrame

In [277]:
df_data["nilai_akhir"] = df_data.apply(lambda x: nilai_akhir(x['nilai_uts'],x['nilai_uas'],x['nilai_tugas']), axis=1)
df_data['grade'] = df_data['nilai_akhir'].apply(tentukan_grade)

### menampilkan data

In [278]:
df_data

     nama        nim  nilai_uts  nilai_uas  nilai_tugas  nilai_akhir grade
0    Budi  123140001         80         90           85         85.5     A
1    Siti  123140002         70         75           80         75.0     B
2    Andi  123140003         65         60           70         64.5     C
3    Rina  123140004         85         80           90         84.5     A
4    Doni  123140005         50         55           60         55.0     D
5    Asep  123140005         76         40           80         62.8     C
6   Tonso  123140005         49         80           90         73.7     B
7    Tini  123140005         65         66           78         69.3     C
8    Susi  123140005         65         65           85         71.0     B
9  Prima   123140119         90         95          100         95.0     A

### Fungsi untuk mencari mahasiswa dengan nilai tertinggi/terendah

In [279]:
def cari_tertinggi_terendah(data):
    for keterangan, mhs in {
        "Mahasiswa dengan Nilai Tertinggi": data.loc[data["nilai_akhir"].idxmax()],
        "Mahasiswa dengan Nilai Terendah" : data.loc[data["nilai_akhir"].idxmin()]
    }.items():
        print(f"\n{keterangan}:")
        print(f"Nama  : {mhs['nama']}")
        print(f"NIM   : {mhs['nim']}")
        print(f"Nilai : {mhs['nilai_akhir']:.2f}")
        print(f"Grade : {mhs['grade']}")

In [280]:
cari_tertinggi_terendah(df_data)

Mahasiswa dengan Nilai Tertinggi:
Nama  : Prima
NIM   : 123140119
Nilai : 95.00
Grade : A

Mahasiswa dengan Nilai Terendah:
Nama  : Doni
NIM   : 123140005
Nilai : 55.00
Grade : D

# ----- Fitur Tambahan -----

### Input data mahasiswa baru

In [281]:
def tambah_data(data):
    nama = input("Nama: ")
    nim = input("NIM: ")
    uts = float(input("Nilai UTS: "))
    uas = float(input("Nilai UAS: "))
    tugas = float(input("Nilai Tugas: "))

    nilai = nilai_akhir(uts, uas, tugas)
    grade = tentukan_grade(nilai)

    # Menambahkan ke file Excel
    data_baru = pd.DataFrame({
        'nama': [nama],
        'nim': [nim],
        'nilai_uts': [uts],
        'nilai_uas': [uas],
        'nilai_tugas': [tugas],
        'nilai_akhir': [nilai],
        'grade': [grade]
    })

    data = pd.concat([data, data_baru], ignore_index=True)
    return data

In [282]:
# df_data = tambah_data(df_data)

In [283]:
# df_data

### Filter Mahasiswa Berdasarkan Grade

In [284]:
def filter_grade(data, grade):
    return data[data["grade"] == grade]

In [285]:
print(filter_grade(df_data, "A")) # Tinggal di sesuaikan dengan kebutuhan
print("\n" + "="*60 + "\n")
print(filter_grade(df_data, "C"))
print("\n" + "="*60 + "\n")
print(filter_grade(df_data, "E"))

     nama        nim  nilai_uts  nilai_uas  nilai_tugas  nilai_akhir grade
0    Budi  123140001         80         90           85         85.5     A
3    Rina  123140004         85         80           90         84.5     A
9  Prima   123140119         90         95          100         95.0     A

============================================================

   nama        nim  nilai_uts  nilai_uas  nilai_tugas  nilai_akhir grade
2  Andi  123140003         65         60           70         64.5     C
5  Asep  123140005         76         40           80         62.8     C
7  Tini  123140005         65         66           78         69.3     C

============================================================

Empty DataFrame
Columns: [nama, nim, nilai_uts, nilai_uas, nilai_tugas, nilai_akhir, grade]
Index: []

### Hitung rata-rata nilai kelas

In [286]:
def rata_kelas(data):
    return data["nilai_akhir"].mean()

In [287]:
print(f"Rata-rata nilai kelas: {rata_kelas(df_data)}")

Rata-rata nilai kelas: 73.63

# -------- Tampilan data awal --------

In [288]:
display(df_data)

     nama        nim  nilai_uts  nilai_uas  nilai_tugas  nilai_akhir grade
0    Budi  123140001         80         90           85         85.5     A
1    Siti  123140002         70         75           80         75.0     B
2    Andi  123140003         65         60           70         64.5     C
3    Rina  123140004         85         80           90         84.5     A
4    Doni  123140005         50         55           60         55.0     D
5    Asep  123140005         76         40           80         62.8     C
6   Tonso  123140005         49         80           90         73.7     B
7    Tini  123140005         65         66           78         69.3     C
8    Susi  123140005         65         65           85         71.0     B
9  Prima   123140119         90         95          100         95.0     A

# -------- Jalankan fitur tambahan --------

### Membuat data mahasiswa baru
### Jadi semua akan di update disini berdasarkan data baru

In [289]:
df_data = tambah_data(df_data)  
cari_tertinggi_terendah(df_data)
display(df_data)
print(f"Rata-rata nilai kelas: {rata_kelas(df_data)}")

Mahasiswa dengan Nilai Tertinggi:
Nama  : Prima
NIM   : 123140119
Nilai : 95.00
Grade : A

Mahasiswa dengan Nilai Terendah:
Nama  : Doni
NIM   : 123140005
Nilai : 55.00
Grade : D

        nama        nim  nilai_uts  nilai_uas  nilai_tugas  nilai_akhir grade
0       Budi  123140001       80.0       90.0         85.0         85.5     A
1       Siti  123140002       70.0       75.0         80.0         75.0     B
2       Andi  123140003       65.0       60.0         70.0         64.5     C
3       Rina  123140004       85.0       80.0         90.0         84.5     A
4       Doni  123140005       50.0       55.0         60.0         55.0     D
5       Asep  123140005       76.0       40.0         80.0         62.8     C
6      Tonso  123140005       49.0       80.0         90.0         73.7     B
7       Tini  123140005       65.0       66.0         78.0         69.3     C
8       Susi  123140005       65.0       65.0         85.0         71.0     B
9     Prima   123140119       90.0       95.0        100.0         95.0     A
10  Kingkong  123140117       70.0       60.0         60.0         63.0     C

Rata-rata nilai kelas: 72.66363636363636

In [290]:
df_data.to_excel('data_mahasiswa.xlsx', index=False)
print("Data baru berhasil disimpan ke file Excel!")

Data baru berhasil disimpan ke file Excel!